Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/matrix.h
/* -------- MATRIX_PSR : (MATRIX Offset: 0x200) (R/W 32) Protection Slave Register -------- */
#define MATRIX_PSR_LAUSERH0_Pos               _UINT32_(0)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH0_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH0_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH0(value)            (MATRIX_PSR_LAUSERH0_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH0_Pos)) /* Assigment of value for LAUSERH0 in the MATRIX_PSR register */
#define MATRIX_PSR_LAUSERH1_Pos               _UINT32_(1)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH1_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH1_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH1(value)            (MATRIX_PSR_LAUSERH1_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH1_Pos)) /* Assigment of value for LAUSERH1 in the MATRIX_PSR register */
#define MATRIX_PSR_LAUSERH2_Pos               _UINT32_(2)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH2_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH2_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH2(value)            (MATRIX_PSR_LAUSERH2_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH2_Pos)) /* Assigment of value for LAUSERH2 in the MATRIX_PSR register */
#define MATRIX_PSR_LAUSERH3_Pos               _UINT32_(3)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH3_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH3_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH3(value)            (MATRIX_PSR_LAUSERH3_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH3_Pos)) /* Assigment of value for LAUSERH3 in the MATRIX_PSR register */
#define MATRIX_PSR_LAUSERH4_Pos               _UINT32_(4)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH4_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH4_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH4(value)            (MATRIX_PSR_LAUSERH4_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH4_Pos)) /* Assigment of value for LAUSERH4 in the MATRIX_PSR register */
#define MATRIX_PSR_LAUSERH5_Pos               _UINT32_(5)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH5_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH5_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH5(value)            (MATRIX_PSR_LAUSERH5_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH5_Pos)) /* Assigment of value for LAUSERH5 in the MATRIX_PSR register */
#define MATRIX_PSR_LAUSERH6_Pos               _UINT32_(6)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH6_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH6_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH6(value)            (MATRIX_PSR_LAUSERH6_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH6_Pos)) /* Assigment of value for LAUSERH6 in the MATRIX_PSR register */
#define MATRIX_PSR_LAUSERH7_Pos               _UINT32_(7)                                          /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR_LAUSERH7_Msk               (_UINT32_(0x1) << MATRIX_PSR_LAUSERH7_Pos)           /* (MATRIX_PSR) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR_LAUSERH7(value)            (MATRIX_PSR_LAUSERH7_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH7_Pos)) /* Assigment of value for LAUSERH7 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH0_Pos               _UINT32_(8)                                          /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH0_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH0_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH0(value)            (MATRIX_PSR_RDUSERH0_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH0_Pos)) /* Assigment of value for RDUSERH0 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH1_Pos               _UINT32_(9)                                          /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH1_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH1_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH1(value)            (MATRIX_PSR_RDUSERH1_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH1_Pos)) /* Assigment of value for RDUSERH1 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH2_Pos               _UINT32_(10)                                         /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH2_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH2_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH2(value)            (MATRIX_PSR_RDUSERH2_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH2_Pos)) /* Assigment of value for RDUSERH2 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH3_Pos               _UINT32_(11)                                         /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH3_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH3_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH3(value)            (MATRIX_PSR_RDUSERH3_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH3_Pos)) /* Assigment of value for RDUSERH3 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH4_Pos               _UINT32_(12)                                         /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH4_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH4_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH4(value)            (MATRIX_PSR_RDUSERH4_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH4_Pos)) /* Assigment of value for RDUSERH4 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH5_Pos               _UINT32_(13)                                         /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH5_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH5_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH5(value)            (MATRIX_PSR_RDUSERH5_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH5_Pos)) /* Assigment of value for RDUSERH5 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH6_Pos               _UINT32_(14)                                         /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH6_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH6_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH6(value)            (MATRIX_PSR_RDUSERH6_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH6_Pos)) /* Assigment of value for RDUSERH6 in the MATRIX_PSR register */
#define MATRIX_PSR_RDUSERH7_Pos               _UINT32_(15)                                         /* (MATRIX_PSR) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR_RDUSERH7_Msk               (_UINT32_(0x1) << MATRIX_PSR_RDUSERH7_Pos)           /* (MATRIX_PSR) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR_RDUSERH7(value)            (MATRIX_PSR_RDUSERH7_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH7_Pos)) /* Assigment of value for RDUSERH7 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH0_Pos               _UINT32_(16)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH0_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH0_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH0(value)            (MATRIX_PSR_WRUSERH0_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH0_Pos)) /* Assigment of value for WRUSERH0 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH1_Pos               _UINT32_(17)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH1_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH1_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH1(value)            (MATRIX_PSR_WRUSERH1_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH1_Pos)) /* Assigment of value for WRUSERH1 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH2_Pos               _UINT32_(18)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH2_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH2_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH2(value)            (MATRIX_PSR_WRUSERH2_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH2_Pos)) /* Assigment of value for WRUSERH2 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH3_Pos               _UINT32_(19)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH3_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH3_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH3(value)            (MATRIX_PSR_WRUSERH3_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH3_Pos)) /* Assigment of value for WRUSERH3 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH4_Pos               _UINT32_(20)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH4_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH4_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH4(value)            (MATRIX_PSR_WRUSERH4_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH4_Pos)) /* Assigment of value for WRUSERH4 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH5_Pos               _UINT32_(21)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH5_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH5_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH5(value)            (MATRIX_PSR_WRUSERH5_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH5_Pos)) /* Assigment of value for WRUSERH5 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH6_Pos               _UINT32_(22)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH6_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH6_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH6(value)            (MATRIX_PSR_WRUSERH6_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH6_Pos)) /* Assigment of value for WRUSERH6 in the MATRIX_PSR register */
#define MATRIX_PSR_WRUSERH7_Pos               _UINT32_(23)                                         /* (MATRIX_PSR) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR_WRUSERH7_Msk               (_UINT32_(0x1) << MATRIX_PSR_WRUSERH7_Pos)           /* (MATRIX_PSR) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR_WRUSERH7(value)            (MATRIX_PSR_WRUSERH7_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH7_Pos)) /* Assigment of value for WRUSERH7 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA0_Pos                 _UINT32_(24)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA0_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA0_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA0(value)              (MATRIX_PSR_DPSOA0_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA0_Pos)) /* Assigment of value for DPSOA0 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA1_Pos                 _UINT32_(25)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA1_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA1_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA1(value)              (MATRIX_PSR_DPSOA1_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA1_Pos)) /* Assigment of value for DPSOA1 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA2_Pos                 _UINT32_(26)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA2_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA2_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA2(value)              (MATRIX_PSR_DPSOA2_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA2_Pos)) /* Assigment of value for DPSOA2 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA3_Pos                 _UINT32_(27)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA3_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA3_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA3(value)              (MATRIX_PSR_DPSOA3_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA3_Pos)) /* Assigment of value for DPSOA3 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA4_Pos                 _UINT32_(28)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA4_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA4_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA4(value)              (MATRIX_PSR_DPSOA4_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA4_Pos)) /* Assigment of value for DPSOA4 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA5_Pos                 _UINT32_(29)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA5_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA5_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA5(value)              (MATRIX_PSR_DPSOA5_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA5_Pos)) /* Assigment of value for DPSOA5 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA6_Pos                 _UINT32_(30)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA6_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA6_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA6(value)              (MATRIX_PSR_DPSOA6_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA6_Pos)) /* Assigment of value for DPSOA6 in the MATRIX_PSR register */
#define MATRIX_PSR_DPSOA7_Pos                 _UINT32_(31)                                         /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR_DPSOA7_Msk                 (_UINT32_(0x1) << MATRIX_PSR_DPSOA7_Pos)             /* (MATRIX_PSR) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR_DPSOA7(value)              (MATRIX_PSR_DPSOA7_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA7_Pos)) /* Assigment of value for DPSOA7 in the MATRIX_PSR register */
#define MATRIX_PSR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MATRIX_PSR) Register Mask  */

#define MATRIX_PSR_LAUSERH_Pos                _UINT32_(0)                                          /* (MATRIX_PSR Position) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH_Msk                (_UINT32_(0xFF) << MATRIX_PSR_LAUSERH_Pos)           /* (MATRIX_PSR Mask) LAUSERH */
#define MATRIX_PSR_LAUSERH(value)             (MATRIX_PSR_LAUSERH_Msk & (_UINT32_(value) << MATRIX_PSR_LAUSERH_Pos)) 
#define MATRIX_PSR_RDUSERH_Pos                _UINT32_(8)                                          /* (MATRIX_PSR Position) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH_Msk                (_UINT32_(0xFF) << MATRIX_PSR_RDUSERH_Pos)           /* (MATRIX_PSR Mask) RDUSERH */
#define MATRIX_PSR_RDUSERH(value)             (MATRIX_PSR_RDUSERH_Msk & (_UINT32_(value) << MATRIX_PSR_RDUSERH_Pos)) 
#define MATRIX_PSR_WRUSERH_Pos                _UINT32_(16)                                         /* (MATRIX_PSR Position) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH_Msk                (_UINT32_(0xFF) << MATRIX_PSR_WRUSERH_Pos)           /* (MATRIX_PSR Mask) WRUSERH */
#define MATRIX_PSR_WRUSERH(value)             (MATRIX_PSR_WRUSERH_Msk & (_UINT32_(value) << MATRIX_PSR_WRUSERH_Pos)) 
#define MATRIX_PSR_DPSOA_Pos                  _UINT32_(24)                                         /* (MATRIX_PSR Position) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA_Msk                  (_UINT32_(0xFF) << MATRIX_PSR_DPSOA_Pos)             /* (MATRIX_PSR Mask) DPSOA */
#define MATRIX_PSR_DPSOA(value)               (MATRIX_PSR_DPSOA_Msk & (_UINT32_(value) << MATRIX_PSR_DPSOA_Pos)) 

/* -------- MATRIX_PASSR : (MATRIX Offset: 0x240) (R/W 32) Protected Areas Split Slave Register -------- */
#define MATRIX_PASSR_PASPLIT0_Pos             _UINT32_(0)                                          /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT0_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT0_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT0(value)          (MATRIX_PASSR_PASPLIT0_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT0_Pos)) /* Assigment of value for PASPLIT0 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT1_Pos             _UINT32_(4)                                          /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT1_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT1_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT1(value)          (MATRIX_PASSR_PASPLIT1_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT1_Pos)) /* Assigment of value for PASPLIT1 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT2_Pos             _UINT32_(8)                                          /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT2_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT2_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT2(value)          (MATRIX_PASSR_PASPLIT2_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT2_Pos)) /* Assigment of value for PASPLIT2 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT3_Pos             _UINT32_(12)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT3_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT3_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT3(value)          (MATRIX_PASSR_PASPLIT3_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT3_Pos)) /* Assigment of value for PASPLIT3 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT4_Pos             _UINT32_(16)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT4_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT4_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT4(value)          (MATRIX_PASSR_PASPLIT4_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT4_Pos)) /* Assigment of value for PASPLIT4 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT5_Pos             _UINT32_(20)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT5_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT5_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT5(value)          (MATRIX_PASSR_PASPLIT5_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT5_Pos)) /* Assigment of value for PASPLIT5 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT6_Pos             _UINT32_(24)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT6_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT6_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT6(value)          (MATRIX_PASSR_PASPLIT6_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT6_Pos)) /* Assigment of value for PASPLIT6 in the MATRIX_PASSR register */
#define MATRIX_PASSR_PASPLIT7_Pos             _UINT32_(28)                                         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR_PASPLIT7_Msk             (_UINT32_(0xF) << MATRIX_PASSR_PASPLIT7_Pos)         /* (MATRIX_PASSR) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR_PASPLIT7(value)          (MATRIX_PASSR_PASPLIT7_Msk & (_UINT32_(value) << MATRIX_PASSR_PASPLIT7_Pos)) /* Assigment of value for PASPLIT7 in the MATRIX_PASSR register */
#define MATRIX_PASSR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MATRIX_PASSR) Register Mask  */


