Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/matrix.h
/* -------- MATRIX_PRTSR : (MATRIX Offset: 0x280) (R/W 32) Protected Region Top Slave Register -------- */
#define MATRIX_PRTSR_PRTOP0_Pos               _UINT32_(0)                                          /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP0_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP0_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP0(value)            (MATRIX_PRTSR_PRTOP0_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP0_Pos)) /* Assigment of value for PRTOP0 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP1_Pos               _UINT32_(4)                                          /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP1_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP1_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP1(value)            (MATRIX_PRTSR_PRTOP1_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP1_Pos)) /* Assigment of value for PRTOP1 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP2_Pos               _UINT32_(8)                                          /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP2_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP2_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP2(value)            (MATRIX_PRTSR_PRTOP2_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP2_Pos)) /* Assigment of value for PRTOP2 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP3_Pos               _UINT32_(12)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP3_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP3_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP3(value)            (MATRIX_PRTSR_PRTOP3_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP3_Pos)) /* Assigment of value for PRTOP3 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP4_Pos               _UINT32_(16)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP4_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP4_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP4(value)            (MATRIX_PRTSR_PRTOP4_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP4_Pos)) /* Assigment of value for PRTOP4 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP5_Pos               _UINT32_(20)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP5_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP5_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP5(value)            (MATRIX_PRTSR_PRTOP5_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP5_Pos)) /* Assigment of value for PRTOP5 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP6_Pos               _UINT32_(24)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP6_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP6_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP6(value)            (MATRIX_PRTSR_PRTOP6_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP6_Pos)) /* Assigment of value for PRTOP6 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_PRTOP7_Pos               _UINT32_(28)                                         /* (MATRIX_PRTSR) HSELx Protected Region Top Position */
#define MATRIX_PRTSR_PRTOP7_Msk               (_UINT32_(0xF) << MATRIX_PRTSR_PRTOP7_Pos)           /* (MATRIX_PRTSR) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR_PRTOP7(value)            (MATRIX_PRTSR_PRTOP7_Msk & (_UINT32_(value) << MATRIX_PRTSR_PRTOP7_Pos)) /* Assigment of value for PRTOP7 in the MATRIX_PRTSR register */
#define MATRIX_PRTSR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MATRIX_PRTSR) Register Mask  */


/* -------- MATRIX_PPSELR : (MATRIX Offset: 0x2C0) (R/W 32) Protected Peripheral Select Register -------- */
#define MATRIX_PPSELR_USERP0_Pos              _UINT32_(0)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP0_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP0_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP0(value)           (MATRIX_PPSELR_USERP0_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP0_Pos)) /* Assigment of value for USERP0 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP1_Pos              _UINT32_(1)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP1_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP1_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP1(value)           (MATRIX_PPSELR_USERP1_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP1_Pos)) /* Assigment of value for USERP1 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP2_Pos              _UINT32_(2)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP2_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP2_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP2(value)           (MATRIX_PPSELR_USERP2_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP2_Pos)) /* Assigment of value for USERP2 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP3_Pos              _UINT32_(3)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP3_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP3_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP3(value)           (MATRIX_PPSELR_USERP3_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP3_Pos)) /* Assigment of value for USERP3 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP4_Pos              _UINT32_(4)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP4_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP4_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP4(value)           (MATRIX_PPSELR_USERP4_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP4_Pos)) /* Assigment of value for USERP4 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP5_Pos              _UINT32_(5)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP5_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP5_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP5(value)           (MATRIX_PPSELR_USERP5_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP5_Pos)) /* Assigment of value for USERP5 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP6_Pos              _UINT32_(6)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP6_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP6_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP6(value)           (MATRIX_PPSELR_USERP6_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP6_Pos)) /* Assigment of value for USERP6 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP7_Pos              _UINT32_(7)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP7_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP7_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP7(value)           (MATRIX_PPSELR_USERP7_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP7_Pos)) /* Assigment of value for USERP7 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP8_Pos              _UINT32_(8)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP8_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP8_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP8(value)           (MATRIX_PPSELR_USERP8_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP8_Pos)) /* Assigment of value for USERP8 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP9_Pos              _UINT32_(9)                                          /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP9_Msk              (_UINT32_(0x1) << MATRIX_PPSELR_USERP9_Pos)          /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP9(value)           (MATRIX_PPSELR_USERP9_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP9_Pos)) /* Assigment of value for USERP9 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP10_Pos             _UINT32_(10)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP10_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP10_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP10(value)          (MATRIX_PPSELR_USERP10_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP10_Pos)) /* Assigment of value for USERP10 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP11_Pos             _UINT32_(11)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP11_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP11_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP11(value)          (MATRIX_PPSELR_USERP11_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP11_Pos)) /* Assigment of value for USERP11 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP12_Pos             _UINT32_(12)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP12_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP12_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP12(value)          (MATRIX_PPSELR_USERP12_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP12_Pos)) /* Assigment of value for USERP12 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP13_Pos             _UINT32_(13)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP13_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP13_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP13(value)          (MATRIX_PPSELR_USERP13_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP13_Pos)) /* Assigment of value for USERP13 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP14_Pos             _UINT32_(14)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP14_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP14_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP14(value)          (MATRIX_PPSELR_USERP14_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP14_Pos)) /* Assigment of value for USERP14 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP15_Pos             _UINT32_(15)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP15_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP15_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP15(value)          (MATRIX_PPSELR_USERP15_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP15_Pos)) /* Assigment of value for USERP15 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP16_Pos             _UINT32_(16)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP16_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP16_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP16(value)          (MATRIX_PPSELR_USERP16_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP16_Pos)) /* Assigment of value for USERP16 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP17_Pos             _UINT32_(17)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP17_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP17_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP17(value)          (MATRIX_PPSELR_USERP17_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP17_Pos)) /* Assigment of value for USERP17 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP18_Pos             _UINT32_(18)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP18_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP18_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP18(value)          (MATRIX_PPSELR_USERP18_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP18_Pos)) /* Assigment of value for USERP18 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP19_Pos             _UINT32_(19)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP19_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP19_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP19(value)          (MATRIX_PPSELR_USERP19_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP19_Pos)) /* Assigment of value for USERP19 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP20_Pos             _UINT32_(20)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP20_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP20_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP20(value)          (MATRIX_PPSELR_USERP20_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP20_Pos)) /* Assigment of value for USERP20 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP21_Pos             _UINT32_(21)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP21_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP21_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP21(value)          (MATRIX_PPSELR_USERP21_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP21_Pos)) /* Assigment of value for USERP21 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP22_Pos             _UINT32_(22)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP22_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP22_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP22(value)          (MATRIX_PPSELR_USERP22_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP22_Pos)) /* Assigment of value for USERP22 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP23_Pos             _UINT32_(23)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP23_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP23_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP23(value)          (MATRIX_PPSELR_USERP23_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP23_Pos)) /* Assigment of value for USERP23 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP24_Pos             _UINT32_(24)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP24_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP24_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP24(value)          (MATRIX_PPSELR_USERP24_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP24_Pos)) /* Assigment of value for USERP24 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP25_Pos             _UINT32_(25)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP25_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP25_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP25(value)          (MATRIX_PPSELR_USERP25_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP25_Pos)) /* Assigment of value for USERP25 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP26_Pos             _UINT32_(26)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP26_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP26_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP26(value)          (MATRIX_PPSELR_USERP26_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP26_Pos)) /* Assigment of value for USERP26 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP27_Pos             _UINT32_(27)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP27_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP27_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP27(value)          (MATRIX_PPSELR_USERP27_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP27_Pos)) /* Assigment of value for USERP27 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP28_Pos             _UINT32_(28)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP28_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP28_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP28(value)          (MATRIX_PPSELR_USERP28_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP28_Pos)) /* Assigment of value for USERP28 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP29_Pos             _UINT32_(29)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP29_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP29_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP29(value)          (MATRIX_PPSELR_USERP29_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP29_Pos)) /* Assigment of value for USERP29 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP30_Pos             _UINT32_(30)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP30_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP30_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP30(value)          (MATRIX_PPSELR_USERP30_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP30_Pos)) /* Assigment of value for USERP30 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_USERP31_Pos             _UINT32_(31)                                         /* (MATRIX_PPSELR) User PSELy Peripheral Position */
#define MATRIX_PPSELR_USERP31_Msk             (_UINT32_(0x1) << MATRIX_PPSELR_USERP31_Pos)         /* (MATRIX_PPSELR) User PSELy Peripheral Mask */
#define MATRIX_PPSELR_USERP31(value)          (MATRIX_PPSELR_USERP31_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP31_Pos)) /* Assigment of value for USERP31 in the MATRIX_PPSELR register */
#define MATRIX_PPSELR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MATRIX_PPSELR) Register Mask  */

